Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/documenting.tmx
Source language: en
Languages: pl

source: Creates a single index entry. Can be made a subentry by separating the subentry text with a semicolon (this notation is also used below to describe what entries are created).
pl: Tworzy pojedynczy wpis indeksu. Może być uczynione podrzędnym wpisem przez oddzielenie tekstu wpisu podrzędnego za pomocą średnika (ta notacja jest także używana poniżej aby opisać które wpisy są tworzone).

source: ``pair: loop; statement`` is a shortcut that creates two index entries, namely ``loop; statement`` and ``statement; loop``.
pl: ``para: pętla; wyrażenie`` jest skrótem który tworzy dwa wpisy indeksu, ``pętla; wyrażenie`` i ``wyrażenie; pętla``.

source: Likewise, ``triple: module; search; path`` is a shortcut that creates three index entries, which are ``module; search path``, ``search; path, module`` and ``path; module search``.
pl: Podobnie ``tryplet: moduł; szukanie; ścieżka`` jest skrótem który tworzy trzy wpisu indeksu, którymi są ``moduł; ścieżka poszukiwania``, ``poszukiwanie; ścieżka, moduł`` i ``ścieżka; poszukiwanie modułu``.

source: These all create two index entries. For example, ``module: hashlib`` creates the entries ``module; hashlib`` and ``hashlib; module``.
pl: Te wszystkie tworzą dwa wpisy indeksu. Na przykład, ``moduł: hashlib`` tworzy wpisy ``moduł; hashlib`` i ``hashlib; moduł``.

source: For index directives containing only "single" entries, there is a shorthand notation::
pl: Dla dyrektyw indeksu zawierających tylko "pojedyncze" wpisy, istnieje skrótowa notacja::

source: .. index:: BNF, grammar, syntax, notation
pl: .. index: BNF, gramatyka, składnia, notacja

source: This creates four index entries.
pl: To tworzy cztery wpisy indeksu.

source: Grammar production displays
pl: Pokazy produkcji gramatycznych

source: Special markup is available for displaying the productions of a formal grammar. The markup is simple and does not attempt to model all aspects of BNF (or any derived forms), but provides enough to allow context-free grammars to be displayed in a way that causes uses of a symbol to be rendered as hyperlinks to the definition of the symbol. There is this directive:
pl: Szczególne adnotacje są dostępne dla pokazywania produkcji gramatyk formalnych. Adnotacje są proste i nie starają się modelować wszystkich aspektów BNF (ani żadnych form pochodnych), ale dostarczają dostatecznie aby pozwolić na gramatyki bez-kontekstowe aby były pokazywane w sposób który powoduje że użycie symbolu będzie pokazane jako hiperłącze do definicji tego symbolu. Oto jest ta dyrektywa:

source: This directive is used to enclose a group of productions. Each production is given on a single line and consists of a name, separated by a colon from the following definition. If the definition spans multiple lines, each continuation line must begin with a colon placed at the same column as in the first line.
pl: Ta dyrektywa jest używana do zamknięcia grupy produkcji gramatycznych. Każda produkcja jest dana w pojedynczej linii i składa się z nazwy, oddzielonej dwukropkiem od następującej po niej definicji. Jeśli definicja rozwija się na kilka linii, każda linia kontynuacji musi zaczynać się od dwukropka umieszczonego w tej samej kolumnie jak w pierwszej linii.

source: Blank lines are not allowed within ``productionlist`` directive arguments.
pl: Puste linie nie są dozwolone wewnątrz parametrów dyrektywy ``productionlist``

source: The definition can contain token names which are marked as interpreted text (e.g. ``unaryneg ::= "-" `integer```) -- this generates cross-references to the productions of these tokens.
pl: Definicja może zawierać nazwy elementów które są oznaczone jako interpretowany tekst (np. ``unaryneg ::= "-" `integer```) -- to generuje krzyżowe-odniesienia do produkcji tych elementów.

source: Note that no further reST parsing is done in the production, so that you don't have to escape ``*`` or ``|`` characters.
pl: Zauważ, że żadne więcej przetwarzanie reST nie jest dokonywane w produkcji, tak że nie musisz ucieczkować znaków ``*`` lub ``|``.

source: The following is an example taken from the Python Reference Manual::
pl: Następujące są przykładami wziętymi z Podręcznika odniesień języka pytonowskiego::

source: Substitutions
pl: Podstawienia

source: The documentation system provides three substitutions that are defined by default. They are set in the build configuration file :file:`conf.py`.
pl: System dokumentacji dostarcza trzech podstawień które są zdefiniowane domyślnie. Są one ustawione w pliku konfiguracji budowania :file:`conf.py`.

source: Replaced by the Python release the documentation refers to. This is the full version string including alpha/beta/release candidate tags, e.g. ``2.5.2b3``.
pl: Zamienione przez wydanie języka pytonowskiego do którego odnosi się dokumentacja. To jest ciąg znaków pełnej wersji zawierającej odnośnik alfa/beta/kandydata do wydania, na przykład: ``2.5.2b3``.

source: Replaced by the Python version the documentation refers to. This consists only of the major and minor version parts, e.g. ``2.5``, even for version 2.5.1.
pl: Zamienione przez wersję języka pytonowskiego do której odnosi się dokumentacja. To składa się tylko z głównej i podrzędnej części wersji np. ``2.5`` nawet dla wersji 2.5.1.

source: Replaced by either today's date, or the date set in the build configuration file. Normally has the format ``April 14, 2007``.
pl: Zamieniane przez albo dzisiejszą datę, albo datę ustawioną w pliku konfiguracji budowy. Zwykle ma format ``Kwiecień 14, 2007``.

source: Footnotes
pl: Uwagi końcowe

source: There is a standard ``.. include`` directive, but it raises errors if the file is not found. This one only emits a warning.
pl: Istnieje standardowa dyrektywa ``.. include``, ale zgłasza ona błędy jeśli plik nie jest znaleziony. Ta tylko zgłasza ostrzeżenie.

source: reStructuredText Primer
pl: reStructuredText Pierwszak

source: This section is a brief introduction to reStructuredText (reST) concepts and syntax, intended to provide authors with enough information to author documents productively. Since reST was designed to be a simple, unobtrusive markup language, this will not take too long.
pl: Ten rozdział jest krótkim wprowadzeniem do pojęć i składni (reST) reStructuredText, przeznaczonych dla zapewnienia autorom dość informacji dla autorstwa dokumentów w produktywny sposób. Ponieważ reST jest zaprojektowany aby być prostym, nieinwazyjnym językiem adnotacji, to nie zajmie długo.

source: See also
pl: Zobacz też.:

source: The authoritative `reStructuredText User Documentation <http://docutils.sourceforge.net/rst.html>`_.
pl: Autorytatywna `Dokumentacja reStructuredText <http://docutils.sourceforge.net/rst.html>`_.

source: Paragraphs
pl: Paragrafy

source: The paragraph is the most basic block in a reST document. Paragraphs are simply chunks of text separated by one or more blank lines. As in Python, indentation is significant in reST, so all lines of the same paragraph must be left-aligned to the same level of indentation.
pl: Ten paragraf jest najbardziej podstawowym blokiem w dokumencie reST. Paragrafy są prosto kawałkami tekstu oddzielonymi przez jedno lub więcej pustą linią. Jak w języku pytonowskim, wcięcie jest istotne w reST, więc wszystkie linie tego samego paragrafu muszą być wyrównane do lewej strony do tego samego poziomu wcięcia.

source: The standard reST inline markup is quite simple: use
pl: Standardowa adnotacja w-jednej-linii reST jest całkiem prosta: użyj

source: one asterisk: ``*text*`` for emphasis (italics),
pl: jednej gwiazdki : ``*tekst*`` dla uwydatnienia (italiki),

source: two asterisks: ``**text**`` for strong emphasis (boldface), and
pl: dwóch gwiazdek: ``**tekst**`` dla głębokiego uwydatnienia (pogrubienia), i

source: backquotes: ````text```` for code samples.
pl: tylne cytaty: ````tekst```` dla przykładów kodu.

source: If asterisks or backquotes appear in running text and could be confused with inline markup delimiters, they have to be escaped with a backslash.
pl: Jeśli gwiazdki i tylne cytaty pojawiają się w ruchomym tekście i mogłyby być pomylone z ogranicznikach adnotacji w-jednej-linii, muszą być ucieczkowane skośnikiem.

source: Be aware of some restrictions of this markup:
pl: Uważaj na pewne ograniczenia tych adnotacji:

source: it may not be nested,
pl: Nie mogą być zagnieżdżane,

source: content may not start or end with whitespace: ``* text*`` is wrong,
pl: treść nie może zaczynać się lub kończyć białymi znakami: ``* tekst*`` jest nieprawidłowe,

source: it must be separated from surrounding text by non-word characters. Use a backslash escaped space to work around that: ``thisis\ *one*\ word``.
pl: powinno być separowane od otaczającego tekstu przez nie-słowne znaki. Używaj skośnika ucieczkowanego odstępu aby to obejść ``tojest\ *jedno*\ słowo``.

source: These restrictions may be lifted in future versions of the docutils.
pl: Te ograniczenia mogą być uchylone w przyszłych wersjach docutils.

source: reST also allows for custom "interpreted text roles"', which signify that the enclosed text should be interpreted in a specific way. Sphinx uses this to provide semantic markup and cross-referencing of identifiers, as described in the appropriate section. The general syntax is ``:rolename:`content```.
pl: reST także pozwala na szczególnie "interpretowane role tekstowe", które oznaczają że zawarty tekst powinien być interpretowany w szczególny sposób. Sphinx używa tego aby dostarczyć składniowe adnotacje i krzyżowe-odniesienia identyfikatorów, jak opisano w odpowiednich sekcjach. Ogólna składnia jest następująca: ``:nazwaroli:`treść```.

source: Lists and Quotes
pl: Listy i Cytaty

source: List markup is natural: just place an asterisk at the start of a paragraph and indent properly. The same goes for numbered lists; they can also be autonumbered using a ``#`` sign::
pl: Adnotacje list są zwyczajne: po prostu umieść znak gwiazdki na początku paragrafu i zrób odpowiednie wcięcie. To samo odnosi się do list ponumerowanych; mogą także być automatycznie ponumerowane używając znaku ``#``::

source: * This is a bulleted list. * It has two items, the second item uses two lines. 1. This is a numbered list. 2. It has two items too. #. This is a numbered list. #. It has two items too.
pl: * To jest wypunktowana lista. * Ma dwa elementy, drugi element używa dwu linii. 1. To jest numerowana lista. 2 Ma także dwa elementy. #To jest numerowana lista. # Ma również dwa elementy.

source: Nested lists are possible, but be aware that they must be separated from the parent list items by blank lines::
pl: Zagnieżdżone listy są możliwe, ale bądź świadomy, że muszą być odseparowane od elementów listy nadrzędnej przez puste linie::

source: * this is * a list * with a nested list * and some subitems * and here the parent list continues
pl: * to jest * lista * z zagnieżdżoną listą * i pewnymi pod-elementami * a tu lista nadrzędna ciągnie się dalej

source: Definition lists are created as follows::
pl: Listy definicji są tworzone jak następuje::

source: term (up to a line of text) Definition of the term, which must be indented and can even consist of multiple paragraphs next term Description.
pl: termin (do linii tekstu) Definicja terminu, która musi być wcięta i może składać się nawet z kilku paragrafów następnego Opisu terminu.

source: Paragraphs are quoted by just indenting them more than the surrounding paragraphs.
pl: Paragrafy są cytowane tylko przez wcięcie ich bardziej niż otaczające paragrafy.

source: Source Code
pl: Kod źródłowy

source: Literal code blocks are introduced by ending a paragraph with the special marker ``::``. The literal block must be indented::
pl: Bloki literalnego kodu są wprowadzane przez zakończenie paragrafu specjalnym znacznikiem ``::``. Blok literalny musi być wcięty::

source: This is a normal text paragraph. The next paragraph is a code sample:: It is not processed in any way, except that the indentation is removed. It can span multiple lines. This is a normal text paragraph again.
pl: To jest zwykły paragraf tekstu. Następnym paragrafem jest przykład kodu:: Nie jest przetwarzany w żaden sposób, z wyjątkiem tego, że wcięcie jest zdejmowane. Może być podzielony na kilka linii. To jest znów paragraf zwykłego tekstu.

source: The handling of the ``::`` marker is smart:
pl: Obsługa znacznika ``::`` jest sprytna:

source: If it occurs as a paragraph of its own, that paragraph is completely left out of the document.
pl: Jeśli zdarzy się jako paragraf sam w sobie, ten paragraf zostanie kompletnie pominięty w dokumencie.

source: If it is preceded by whitespace, the marker is removed.
pl: Jeśli jest poprzedzony białym znakiem, znacznik jest usuwany

source: If it is preceded by non-whitespace, the marker is replaced by a single colon.
pl: Jeśli jest poprzedzony nie-białym znakiem, znacznik jest zamieniany przez pojedynczy dwukropek.

source: That way, the second sentence in the above example's first paragraph would be rendered as "The next paragraph is a code sample:".
pl: W ten sposób drugie zdanie pierwszym paragrafie powyższego przykładu byłoby wypisane jako "Następnym paragrafem jest przykład kodu:".

source: Hyperlinks
pl: Hiperłącza

source: External links
pl: Łącza zewnętrzne

source: Use ```Link text <http://target>`_`` for inline web links. If the link text should be the web address, you don't need special markup at all, the parser finds links and mail addresses in ordinary text.
pl: Użyj ```Tekst łącza <http://cel>`_`` dla w-jednej-linii łącz sieciowych. Jeśli tekst łącza powinien być adresem sieciowym, nie trzeba szczególnej adnotacji w ogóle, gdyż program wczytujący znajduje łącza i adresy pocztowe w zwykłym tekście.

source: Internal links
pl: Wewnętrzne łącza

source: Internal linking is done via a special reST role, see the section on specific markup, :ref:`doc-ref-role`.
pl: Wewnętrzne łączenie jest dokonywane przez specjalną rolę reST, zobacz rozdział o szczególnej adnotacji :ref:`doc-ref-role`.

source: Sections
pl: Sekcje

source: Section headers are created by underlining (and optionally overlining) the section title with a punctuation character, at least as long as the text::
pl: Nagłówki sekcji są tworzone przez podkreślenia (i opcjonalnie zakreślenia) tytułu rozdziału za pomocą znaku wypunktowania, przynajmniej tak długiego jak tekst::

source: ================= This is a heading =================
pl: ================= To jest nagłówek =================

source: Normally, there are no heading levels assigned to certain characters as the structure is determined from the succession of headings. However, for the Python documentation, we use this convention:
pl: Zwykle nie ma poziomów nagłówków przypisanych do konkretnych znaków jako, że struktura decyduje się w zależności od kolejności tych nagłówków. Jednakże dla dokumentacji języka pytonowskiego, używamy tej konwencji:

source: ``#`` with overline, for parts
pl: ``#`` z zakreśleniem, dla części

source: ``*`` with overline, for chapters
pl: ``*`` z zakreśleniem, dla rozdziałów

source: ``=``, for sections
pl: ``=``, dla sekcji

source: ``-``, for subsections
pl: ``-``, dla podsekcji

source: ``^``, for subsubsections
pl: ``^``, dla pod-podsekcji

source: ``"``, for paragraphs
pl: ``"``, dla paragrafów

source: Explicit Markup
pl: Jawne adnotacje

source: "Explicit markup" is used in reST for most constructs that need special handling, such as footnotes, specially-highlighted paragraphs, comments, and generic directives.
pl: "Jawne adnotacje" są używane w reST dla większości konstrukcji, które wymagają szczególnego traktowania, takich jak uwagi końcowe, szczególnie-wyróżnione paragrafy, komentarze i dyrektywy generyczne.

source: An explicit markup block begins with a line starting with ``..`` followed by whitespace and is terminated by the next paragraph at the same level of indentation. (There needs to be a blank line between explicit markup and normal paragraphs. This may all sound a bit complicated, but it is intuitive enough when you write it.)
pl: Jawny blok adnotacji zaczyna się od linii zaczynającej się na ``..`` po której następują białe znaki, i jest zakończona następnym paragrafem na tym samym poziomie wcięcia. (Istnieje potrzeba pustej linii pomiędzy jawnymi adnotacjami i zwykłymi paragrafami. To może brzmieć nieco skomplikowanie, ale jest intuicyjne dość gdy to piszesz.)

source: Directives
pl: Dyrektywy

source: A directive is a generic block of explicit markup. Besides roles, it is one of the extension mechanisms of reST, and Sphinx makes heavy use of it.
pl: Dyrektywa jest zastępczym blokiem jawnych adnotacji. Poza rolami, jest to jeden z mechanizmów rozszerzania reST, a Sphinx wiele razy z tego korzysta.

source: Basically, a directive consists of a name, arguments, options and content. (Keep this terminology in mind, it is used in the next chapter describing custom directives.) Looking at this example, ::
pl: Zazwyczaj, dyrektywa składa się z nazwy, parametrów, opcji i treści. (Zapamiętaj tą terminologię, gdyż jest używana w następnym rozdziale opisującym szczególne dyrektywy.) Patrząc na ten przykład, ::

source: .. function:: foo(x) foo(y, z) :bar: no Return a line of text input from the user.
pl: .. function:: foo(x) foo(y, z) :bar: no Zwróć linię tekstu wpisanego przez użytkownika.

source: ``function`` is the directive name. It is given two arguments here, the remainder of the first line and the second line, as well as one option ``bar`` (as you can see, options are given in the lines immediately following the arguments and indicated by the colons).
pl: ``function`` ( - z ang. - ``zadanie``) - jest nazwą dyrektywy. Występuje z dwoma parametrami, resztą pierwszej linii i drugą linią, i także jedną opcją ``bar`` (jak widać, opcje są podane w liniach natychmiast następujących po parametrach i zaznaczone przez dwukropki).

source: The directive content follows after a blank line and is indented relative to the directive start.
pl: Treść dyrektywy podąża za pustą linią i jest wcięta względem początku dyrektywy.

source: For footnotes, use ``[#]_`` to mark the footnote location, and add the footnote body at the bottom of the document after a "Footnotes" rubric heading, like so::
pl: Dla przypisów dolnych, używaj ``[#]_`` aby zaznaczyć położenie przypisu dolnego, i dodaj treść przypisu na dole dokumentu po nagłówku rubryki "Footnotes", tak jak::

source: Lorem ipsum [#]_ dolor sit amet ... [#]_ .. rubric:: Footnotes .. [#] Text of the first footnote. .. [#] Text of the second footnote.
pl: Lorem ipsum [#]_ dolor sit amet ... [#]_ .. rubric:: Footnotes .. [#] Treść pierwszego przypisu dolnego. .. [#] Treść drugiego przypisu dolnego.

source: You can also explicitly number the footnotes for better context.
pl: Możesz także jawnie ponumerować przypisy dolne dla lepszego kontekstu.

source: Comments
pl: Komentarze

source: Every explicit markup block which isn't a valid markup construct (like the footnotes above) is regarded as a comment.
pl: Każdy jawny blok adnotacji który nie jest prawidłowym konstruktem adnotacji (tak jak przypisy powyżej) jest uważany za komentarz.

source: Source encoding
pl: Kodowanie źródła

source: Since the easiest way to include special characters like em dashes or copyright signs in reST is to directly write them as Unicode characters, one has to specify an encoding:
pl: Ponieważ najłatwiejszym sposobem załączenia szczególnych znaków, jak kresek, lub znaków praw autorskich w reST jest sposób, aby zapisać je bezpośrednio jako znaki Unicode, dlatego trzeba określić kodowanie:

source: All Python documentation source files must be in UTF-8 encoding, and the HTML documents written from them will be in that encoding as well.
pl: Wszystkie pliki źródłowe dokumentacji muszą być zakodowane w UTF-8, i dokumenty HTML zapisane z nich będą w tym kodowaniu także.

source: Gotchas
pl: Mamy-cia

source: There are some problems one commonly runs into while authoring reST documents:
pl: Istnieją pewne problemy na które można natknąć się zwykle gdy pisze się dokumenty w reST:

source: **Separation of inline markup:** As said above, inline markup spans must be separated from the surrounding text by non-word characters, you have to use an escaped space to get around that.
pl: **Separcja adnotacji w-jednej-linii:** Jak powiedziano powyżej, adnotacje w-jednej-linii muszą być odseparowane od otaczającego tekstu przez znaki nie-słów, trzeba użyć ucieczkowanego odstępu aby to obejść.

source: Style Guide
pl: Przewodnik stylu

source: The Python documentation should follow the `Apple Publications Style Guide`_ wherever possible. This particular style guide was selected mostly because it seems reasonable and is easy to get online.
pl: Dokumentacja języka pytonowskiego powinna być zgodna ze `Przewodnikiem po stylu publikacji firmy Apple`_ gdzie tylko się da. Ten szczególny przewodnik po stylu został wybrany głównie ponieważ jest rozsądny i łatwo dostępny w sieci.

source: Topics which are not covered in Apple's style guide will be discussed in this document.
pl: Tematy które nie są opisane w przewodniku po stylu firmy Apple będą opisane w tym dokumencie.

source: All reST files use an indentation of 3 spaces. The maximum line length is 80 characters for normal text, but tables, deeply indented code samples and long links may extend beyond that.
pl: Wszystkie pliki reST używają wcięcia 3 odstępów. Maksymalna długość linii jest 80 znaków dla zwykłego tekstu, ale tabele, głęboko wcięte przykłady kodu i długie łącza mogą wychodzić ponad to.

source: Make generous use of blank lines where applicable; they help grouping things together.
pl: Czyń hojny użytek z pustych linii gdzie to odpowiada potrzebom; pomagają grupować rzeczy razem.

source: A sentence-ending period may be followed by one or two spaces; while reST ignores the second space, it is customarily put in by some users, for example to aid Emacs' auto-fill mode.
pl: Po kropce kończącej-zdanie mogą być użyte jeden lub dwa odstępy; podczas gdy reST ignoruje drugą spację, jest ona dodawana zwyczajowo przez niektórych użytkowników, dla przykładu, aby pomóc w trybie auto-uzupełniania w Emacs.

source: Footnotes are generally discouraged, though they may be used when they are the best way to present specific information. When a footnote reference is added at the end of the sentence, it should follow the sentence-ending punctuation. The reST markup should appear something like this::
pl: Przypisy dolne są zwykle odradzane, chociaż mogą być użyte, gdy są najlepszym sposobem aby zaprezentować pewne szczególne informacje. Gdy odniesienie do przypisu dolnego jest dodane na koniec zdania, powinno stosować się do znaków przestankowych końca zdania. Adnotacje reST powinno wyglądać następująco::

source: This sentence has a footnote reference. [#]_ This is the next sentence.
pl: To zdanie ma odniesienie do przypisów dolnych. [#]_ To jest następne zdanie.

source: Footnotes should be gathered at the end of a file, or if the file is very long, at the end of a section. The docutils will automatically create backlinks to the footnote reference.
pl: Przypisy końcowe powinny być zgromadzone na koniec pliku, lub gdy plik jest bardzo długi, na koniec sekcji. Docutils automatycznie tworzy łącza powrotne do odniesienia przypisu dolnego.

source: Footnotes may appear in the middle of sentences where appropriate.
pl: Przypisy dolne mogą pojawić się w środku zdania gdzie jest to odpowiednie.
